bit-finance/Reports/бит_УниверсальныеСоответствияАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_УниверсальныеСоответствияАналитик</Name>
		</Properties>
	</Report>
</MetaDataObject>

bit-finance/InformationRegisters/бит_СоответствияАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СоответствияАналитик</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыСоответствийАналитик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Catalogs/бит_ВидыСоответствийАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыСоответствийАналитик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Соотношение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСоотношенийАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьПриПолномСовпаденииТипов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнализироватьКорреспондирующийСчет</Name>
					<Comment>Анализировать корреспондирующий счет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Reports/бит_УниверсальныеСоответствияАналитик/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Подход к изменению схемы "на лету" скопирован в Универсальном отчете.
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//	 ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "УниверсальныеСоответствияАналитик");
	ОписаниеВарианта.Описание = НСтр("ru = 'Выводит настройки универсального соответствия аналитик.'");

	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьНастройкиПриИзмененииПараметров() Экспорт 
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ВидСоответствия"));
	
	Возврат Параметры;
	
КонецФункции

Функция ФиксированныеПараметры(Настройки, ПользовательскиеНастройки, ДоступныеЗначения) Экспорт 
	
	// Значения параметров по умолчанию.
	ФиксированныеПараметры = Новый Структура;
	ФиксированныеПараметры.Вставить("ВидСоответствия", Справочники.бит_ВидыСоответствийАналитик.ПустаяСсылка());
	
	Идентификаторы = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ФиксированныеПараметры, ",");
	Идентификаторы = СтрРазделить(Идентификаторы, ", ", Ложь);
	Для каждого Идентификатор Из Идентификаторы Цикл
		УстановитьФиксированныйПараметр(Идентификатор, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	КонецЦикла; 
	
	Возврат ФиксированныеПараметры;
	
КонецФункции

// Устанавливает значения специализированных параметров универсального отчета.
//
// Параметры:
//  Отчет - 
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных - 
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - 
//
Процедура УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки) Экспорт 
	ПараметрыДанных = Настройки.ПараметрыДанных;
	
	ДоступныеПараметры = ПараметрыДанных.ДоступныеПараметры;
	Если ДоступныеПараметры = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Параметр Из ФиксированныеПараметры Цикл 
		Если ДоступныеПараметры.Элементы.Найти(Параметр.Ключ) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭлементНастройки = ПараметрыДанных.Элементы.Найти(Параметр.Ключ);
		Если ЭлементНастройки = Неопределено Тогда 
			ЭлементНастройки = ПараметрыДанных.Элементы.Добавить();
			ЭлементНастройки.Параметр = Новый ПараметрКомпоновкиДанных(Параметр.Ключ);
			ЭлементНастройки.Значение = Параметр.Значение;
			ЭлементНастройки.Использование = Истина;
		Иначе
			ПараметрыДанных.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;
		
		ЭлементПользовательскойНастройки = Неопределено;
		Если ПользовательскиеНастройки <> Неопределено Тогда 
			ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
				ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		КонецЕсли;
		
		Если ЭлементПользовательскойНастройки <> Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(ЭлементПользовательскойНастройки, ЭлементНастройки, "Использование, Значение");
		КонецЕсли;
	КонецЦикла;
	
	Если ПользовательскиеНастройки <> Неопределено Тогда 
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
	КонецЕсли;
КонецПроцедуры

// Устанавливает настройки по умолчанию.
//
// Параметры:
//  Отчет - ОтчетОбъект - 
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных - 
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - 
//
Процедура УстановитьСтандартныеНастройки(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки) Экспорт 
	
	ОтчетИнициализирован = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "ОтчетИнициализирован", Ложь);
	
	Если ОтчетИнициализирован Тогда 
		Возврат;
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	ПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	
	Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
	
КонецПроцедуры

Функция СхемаКомпоновкиДанных(ФиксированныеПараметры) Экспорт 
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Если ЗначениеЗаполнено(ФиксированныеПараметры.ВидСоответствия) Тогда
		НастройкиНабора = НастройкиНабора(ФиксированныеПараметры.ВидСоответствия);
		
		Если НЕ ПустаяСтрока(НастройкиНабора.ТекстЗапроса) Тогда
			СхемаКомпоновкиДанных.НаборыДанных.Результат.Запрос = НастройкиНабора.ТекстЗапроса;
			НастройкиПолей = НастройкиНабора.НастройкиПолей;
			Для каждого КлючЗначение Из НастройкиПолей Цикл
				ПутьКДанным	  = КлючЗначение.Ключ;
				НастройкаПоля = КлючЗначение.Значение;
				Поле 		  = СхемаКомпоновкиДанных.НаборыДанных.Результат.Поля.Найти(ПутьКДанным);
				Если Поле = Неопределено Тогда
					Продолжить;			
				КонецЕсли;
				
				Если НастройкаПоля.Использование Тогда
					Поле.Заголовок	 = НастройкаПоля.Заголовок;
					Поле.ТипЗначения = НастройкаПоля.ТипЗначения;
				Иначе
					Поле.ОграничениеИспользования.Группировка = Истина;
					Поле.ОграничениеИспользования.Поле        = Истина;
					Поле.ОграничениеИспользования.Условие     = Истина;
					Поле.ОграничениеИспользования.Порядок     = Истина;
					
					Поле.ОграничениеИспользованияРеквизитов.Группировка = Истина;
					Поле.ОграничениеИспользованияРеквизитов.Поле        = Истина;
					Поле.ОграничениеИспользованияРеквизитов.Условие     = Истина;
					Поле.ОграничениеИспользованияРеквизитов.Порядок     = Истина;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;

	Возврат СхемаКомпоновкиДанных;
	
КонецФункции
 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция НастройкиНабора(ВидСоответствия)
	
	НастройкиПолей	= НовыеНастройкиПолей(); 
	ТекстЗапроса	= "";
	НастройкиНабора = Новый Структура("ТекстЗапроса, НастройкиПолей", ТекстЗапроса, НастройкиПолей);  

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыСоответствий.ЛеваяАналитика_1.ТипЗначения КАК ЛеваяАналитика_1ТипЗначения,
	|	ВидыСоответствий.ЛеваяАналитика_2.ТипЗначения КАК ЛеваяАналитика_2ТипЗначения,
	|	ВидыСоответствий.ЛеваяАналитика_3.ТипЗначения КАК ЛеваяАналитика_3ТипЗначения,
	|	ВидыСоответствий.ПраваяАналитика_1.ТипЗначения КАК ПраваяАналитика_1ТипЗначения,
	|	ВидыСоответствий.ПраваяАналитика_2.ТипЗначения КАК ПраваяАналитика_2ТипЗначения,
	|	ВидыСоответствий.ПраваяАналитика_3.ТипЗначения КАК ПраваяАналитика_3ТипЗначения,
	|	ВидыСоответствий.ЛеваяАналитика_1.Наименование КАК ЛеваяАналитика_1Наименование,
	|	ВидыСоответствий.ЛеваяАналитика_2.Наименование КАК ЛеваяАналитика_2Наименование,
	|	ВидыСоответствий.ЛеваяАналитика_3.Наименование КАК ЛеваяАналитика_3Наименование,
	|	ВидыСоответствий.ПраваяАналитика_1.Наименование КАК ПраваяАналитика_1Наименование,
	|	ВидыСоответствий.ПраваяАналитика_2.Наименование КАК ПраваяАналитика_2Наименование,
	|	ВидыСоответствий.ПраваяАналитика_3.Наименование КАК ПраваяАналитика_3Наименование,
	|	ВидыСоответствий.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	ВидыСоответствий.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	ВидыСоответствий.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	ВидыСоответствий.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	ВидыСоответствий.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	ВидыСоответствий.ПраваяАналитика_3 КАК ПраваяАналитика_3
	|ИЗ
	|	Справочник.бит_ВидыСоответствийАналитик КАК ВидыСоответствий
	|ГДЕ
	|	ВидыСоответствий.Ссылка = &ВидСоответствия";
	
	Запрос.УстановитьПараметр("ВидСоответствия", ВидСоответствия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьНастройкуПоля("ЛеваяАналитика_1", "Источник", Выборка, НастройкиПолей);
		ЗаполнитьНастройкуПоля("ЛеваяАналитика_2", "Источник", Выборка, НастройкиПолей);
		ЗаполнитьНастройкуПоля("ЛеваяАналитика_3", "Источник", Выборка, НастройкиПолей);
		
		ЗаполнитьНастройкуПоля("ПраваяАналитика_1", "Приемник", Выборка, НастройкиПолей);
		ЗаполнитьНастройкуПоля("ПраваяАналитика_2", "Приемник", Выборка, НастройкиПолей);
		ЗаполнитьНастройкуПоля("ПраваяАналитика_3", "Приемник", Выборка, НастройкиПолей);
	КонецЦикла;
	
	Если НЕ НастройкиПолей["Источник.ЛеваяАналитика_1"].Использование Тогда
		Возврат НастройкиНабора;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачалоИспользования.ЛеваяАналитика_1 КАК ЛеваяАналитика_1,
	|	НачалоИспользования.ЛеваяАналитика_2 КАК ЛеваяАналитика_2,
	|	НачалоИспользования.ЛеваяАналитика_3 КАК ЛеваяАналитика_3,
	|	НачалоИспользования.ПраваяАналитика_1 КАК ПраваяАналитика_1,
	|	НачалоИспользования.ПраваяАналитика_2 КАК ПраваяАналитика_2,
	|	НачалоИспользования.ПраваяАналитика_3 КАК ПраваяАналитика_3,
	|	НачалоИспользования.Используется КАК Используется,
	|	НачалоИспользования.Период КАК ДатаНачала,
	|	КонецИспользования.Период КАК ДатаОкончания,
	|	НачалоИспользования.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_СоответствияАналитик
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик.СрезПоследних(&Период, ВидСоответствия = &ВидСоответствия) КАК НачалоИспользования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СоответствияАналитик.СрезПервых(&ПериодОкончание {(&ПериодОкончание)}, ВидСоответствия = &ВидСоответствия) КАК КонецИспользования
	|		ПО НачалоИспользования.ЛеваяАналитика_1 = КонецИспользования.ЛеваяАналитика_1
	|			И НачалоИспользования.ЛеваяАналитика_2 = КонецИспользования.ЛеваяАналитика_2
	|			И НачалоИспользования.ЛеваяАналитика_3 = КонецИспользования.ЛеваяАналитика_3
	|			И (НачалоИспользования.Используется)
	|			И (КонецИспользования.Используется = ЛОЖЬ)
	|ГДЕ
	|	НачалоИспользования.Используется";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
	ШаблонТекста = 
	"ВЫБРАТЬ
	|	&ВидСоответствия КАК ВидСоответствия,
	|	НЕ СоответствияАналитик.ЛеваяАналитика_1 ЕСТЬ NULL КАК Сопоставлено,
	|	Таблица.Ссылка КАК ЛеваяАналитика_1,
	|	ЕСТЬNULL(СоответствияАналитик.ЛеваяАналитика_2, НЕОПРЕДЕЛЕНО) КАК ЛеваяАналитика_2,
	|	ЕСТЬNULL(СоответствияАналитик.ЛеваяАналитика_3, НЕОПРЕДЕЛЕНО) КАК ЛеваяАналитика_3,
	|	ЕСТЬNULL(СоответствияАналитик.ПраваяАналитика_1, НЕОПРЕДЕЛЕНО) КАК ПраваяАналитика_1,
	|	ЕСТЬNULL(СоответствияАналитик.ПраваяАналитика_2, НЕОПРЕДЕЛЕНО) КАК ПраваяАналитика_2,
	|	ЕСТЬNULL(СоответствияАналитик.ПраваяАналитика_3, НЕОПРЕДЕЛЕНО) КАК ПраваяАналитика_3,
	|	СоответствияАналитик.Регистратор КАК Регистратор,
	|	СоответствияАналитик.ДатаНачала, 
	|	СоответствияАналитик.ДатаОкончания
	|ИЗ
	|	#Таблица КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СоответствияАналитик КАК СоответствияАналитик
	|		ПО Таблица.Ссылка = СоответствияАналитик.ЛеваяАналитика_1
	|ГДЕ
	|	&НеГруппа";
	
	Разделитель = 
	"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";

	ТипЗначения	 = НастройкиПолей["Источник.ЛеваяАналитика_1"].ТипЗначения;
	ПервыйЗапрос = Истина;
	Для каждого Элемент Из ТипЗначения.Типы() Цикл
		Если НЕ ОбщегоНазначения.ЭтоСсылка(Элемент) Тогда
			Продолжить;	
		КонецЕсли;
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Элемент);
		Менеджер   		 = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
		ИмяТаблицы 		 = ОбщегоНазначения.ИмяТаблицыПоСсылке(Менеджер.ПустаяСсылка());
		
		ИерархияГрупп = Ложь;
		Если ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
			Иерархический = ОбъектМетаданных.Иерархический;
			Если Иерархический Тогда
				ВидИерархии   = ОбъектМетаданных.ВидИерархии;
				ИерархияГрупп = ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов
			КонецЕсли;
		ИначеЕсли ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных) Тогда
			ИерархияГрупп = ОбъектМетаданных.Иерархический;
		КонецЕсли;
		
		Текст = ШаблонТекста;
		Если ПервыйЗапрос Тогда
			ЧтоЗаменить   = "ВЫБРАТЬ";
			НаЧтоЗаменить = "ВЫБРАТЬ РАЗРЕШЕННЫЕ";
			Текст 		  = СтрЗаменить(Текст, ЧтоЗаменить, НаЧтоЗаменить);
			ПервыйЗапрос  = Ложь;
		Иначе
			Текст = Разделитель + Текст;
		КонецЕсли;
	
		ЧтоЗаменить   = "#Таблица";
		НаЧтоЗаменить = ИмяТаблицы;
		Текст 		  = СтрЗаменить(Текст, ЧтоЗаменить, НаЧтоЗаменить);

		ЧтоЗаменить   = "&НеГруппа";
		НаЧтоЗаменить = ?(ИерархияГрупп, "НЕ Таблица.ЭтоГруппа", "Истина");
		Текст 		  = СтрЗаменить(Текст, ЧтоЗаменить, НаЧтоЗаменить);
		
		ТекстЗапроса = ТекстЗапроса + Текст;
	КонецЦикла; 
	
	НастройкиНабора = Новый Структура("ТекстЗапроса, НастройкиПолей", ТекстЗапроса, НастройкиПолей);
	
	Возврат НастройкиНабора;
	
КонецФункции

Процедура ЗаполнитьНастройкуПоля(ПутьКДанным, Суффикс, Выборка, НастройкиПолей)

	Настройка = НовоеОписаниеНастройкиПоля();
	Настройка.Использование = ЗначениеЗаполнено(Выборка[ПутьКДанным]);
	Настройка.ТипЗначения	= Выборка[ПутьКДанным + "ТипЗначения"];
	Настройка.Заголовок 	= Выборка[ПутьКДанным + "Наименование"];

	НастройкиПолей.Вставить(Суффикс + "." + ПутьКДанным, Настройка);
	
КонецПроцедуры

Функция НовыеНастройкиПолей()

	НастройкиПолей	= Новый Соответствие; 
	НастройкиПолей.Вставить("Источник.ЛеваяАналитика_1", НовоеОписаниеНастройкиПоля());
	НастройкиПолей.Вставить("Источник.ЛеваяАналитика_2", НовоеОписаниеНастройкиПоля());
	НастройкиПолей.Вставить("Источник.ЛеваяАналитика_3", НовоеОписаниеНастройкиПоля());
	
	НастройкиПолей.Вставить("Приемник.ПраваяАналитика_1", НовоеОписаниеНастройкиПоля());
	НастройкиПолей.Вставить("Приемник.ПраваяАналитика_2", НовоеОписаниеНастройкиПоля());
	НастройкиПолей.Вставить("Приемник.ПраваяАналитика_3", НовоеОписаниеНастройкиПоля());
	
	Возврат НастройкиПолей;
	
КонецФункции

Функция НовоеОписаниеНастройкиПоля()

	Возврат Новый Структура("Использование, ТипЗначения, Заголовок", Ложь, Новый ОписаниеТипов, "");

КонецФункции

Процедура УстановитьФиксированныйПараметр(Идентификатор, Параметры, Настройки, ПользовательскиеНастройки, ДоступныеЗначения = Неопределено)
	
	ФиксированныйПараметр = Параметры[Идентификатор];
	
	Если ДоступныеЗначения = Неопределено Тогда 
		ДоступныеЗначения = Новый СписокЗначений;
	КонецЕсли;
	
	ЭлементНастройки = Настройки.ПараметрыДанных.Элементы.Найти(Идентификатор);
	Если ЭлементНастройки = Неопределено Тогда 
		Если ДоступныеЗначения.Количество() > 0 Тогда 
			Параметры[Идентификатор] = ДоступныеЗначения[0].Значение;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементПользовательскойНастройки = Неопределено;
	Если ТипЗнч(ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных")
		И (Настройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")
		Или ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")) Тогда 
		
		ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	
	Если ЭлементПользовательскойНастройки <> Неопределено
		И ДоступныеЗначения.НайтиПоЗначению(ЭлементПользовательскойНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ДоступныеЗначения.НайтиПоЗначению(ЭлементНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	ИначеЕсли ДоступныеЗначения.Количество() > 0 Тогда 
		ФиксированныйПараметр = ДоступныеЗначения[0].Значение;
	ИначеЕсли ЭлементПользовательскойНастройки <> Неопределено
		И ЗначениеЗаполнено(ЭлементПользовательскойНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ЗначениеЗаполнено(ЭлементНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	КонецЕсли;
	
	Параметры[Идентификатор] = ФиксированныйПараметр;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
